app/models/shortened_url.rb

  def self.create_url(user, long_url)
    ShortenedUrl.create!(
      :long_url => long_url,
      :short_url => ShortenedUrl.random_code,
      :user_id => user.id
    )
---
INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["long_url", "youtube.com"], ["short_url", "IA5JW7o9obiVjtbnqY4fvw"], ["user_id", 4]]

  def self.random_code
    code = SecureRandom.urlsafe_base64
    code = SecureRandom.urlsafe_base64 while ShortenedUrl.exists?(:short_url => code)
---
SELECT 1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "IA5JW7o9obiVjtbnqY4fvw"], ["LIMIT", 1]]