app/models/visit.rb

INSERT INTO "visits" ("short_url_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["short_url_id", 4], ["user_id", 4], ["created_at", "2021-04-18 10:31:21.367817"], ["updated_at", "2021-04-18 10:31:21.367817"]]
---
  def self.record_visit!(user, shortened_url)
    Visit.create!(:user_id => user.id, :short_url => shortened_url)